{"text":{"564004":"I blame the baseband processor.<p>That thing is evil!","2975425":"It&#x27;s the worst date faking attempt in history if that was his intention - I think he republished his 2005 story after bitcoin to point out that he came up with these ideas.","1189508":"So Google Translate is just being terrible again? Figures.","728949":"Children already think animal slaughter is horrific. Then they get greedy about meat.","1632060":"Horrible attempt at vote manipulation <a href=\"http:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;1h7c5\" rel=\"nofollow\">http:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;1h7c5<\/a>","2448761":"Site looks terribly defunct. No announcements since 2012?","2042501":"Yes, and you also just invoked horrible memories of CompuServe&#x27;s &quot;GO&quot; keywords.","1011251":"Man. I had to re-read the title of this article five times, before I understood the intended meaning. What a terrible wording.","547517":"When the standing desk thing got boring for me, I added a balance board instead of a treadmill.","890923":"aaaargh those color schemes in [1] are horrible!","1784634":"You&#x27;re being awfully presumptuous -- there&#x27;s nothing to indicate the parent isn&#x27;t already using an apache2+php-fpm setup. Not all apache2+php users are using mod_php (which is where performance woes come from).","2924328":"So the message is: don&#x27;t trust the integrity of encrypted mails unless the signature is valid? That doesn&#x27;t seem too terrible.","532553":"You&#x27;d have to bypass a nasty warning from your browser before this could happen.","2012230":"Grunt <i>is<\/i> a code smell. It&#x27;s hipsterware at it&#x27;s worst.","1542913":"Stuck in the vicious loop with you. I can&#x27;t imagine adding kids to the mix.","2331636":"Worst case performance of a Map is O(n).","1229365":"If you build systems that are part of an existing ecosystem, specifically an ecosystem built on Java technologies, then Guile or Racket would be terrible choices.","813338":"The UI is horrendous! I would use OSM but it is so terrible I can&#x27;t. I use it when I dont want to go online, but it is truly awful.","2258426":"I think your team is one of the worst things to happen to .NET.  No offense, but that sounds like hell.","2331733":"Shocking, an US newspaper advising against the Euro","1720617":"Locks to &quot;Lenovo provided&quot; cards, I said.  That leaves Lenovo-branded iwl or some rando Lenovo-branded Realtek(?) card that has terrible support.","1398093":"SBT has a terrible habit of breaking backwards compatibility, which has put me off it.","2297321":"Worst dating book ever.","1969363":"<a href=\"http:&#x2F;&#x2F;www.globaltimes.cn&#x2F;content&#x2F;922351.shtml\" rel=\"nofollow\">http:&#x2F;&#x2F;www.globaltimes.cn&#x2F;content&#x2F;922351.shtml<\/a><p>Yes this is just one article, but it doesn&#x27;t mention anything about post-birth selection. That would be terrible. I just don&#x27;t believe it is happening at scale - people are not that evil.","955502":"This is insane.","2558192":"I would say that C#&#x27;s language evolution is too closely tied with the terrible frameworks as well as legacy they have to support.","2191605":"Criticize TED, cite &quot;the 20 all-time worst TED talks&quot; by a Buzzfeed editor who also wrote &quot;39 Things That Look Like Boobs.&quot;","608808":"Mainline Firefox still tears horribly on every platform where the WM doesn&#x27;t transparently handle the draws. Will this be included for the entirety of the browser, or just B2G?","2476262":"I hope the buy a task&#x2F;todo company soon. Tasks is terrible.","2763525":"... and I&#x27;m just sitting here, finding it horrible that even ZDnet articles make the its --&gt; it&#x27;s mistake these days :-&#x2F;","2781912":"tl,dr: runtime array bound checking which assumes explicit annotations are correct, which is to say this dialect can&#x27;t relieve you of the need for unattainable perfection from everyone who ever touched the code, and humans writing C is still a terrible mistake.","1880094":"Why is it a horrible place to work?","1515531":"There are a lot of terrible opinions on that person&#x27;s blog.","2972426":"&quot;Streisanded&quot;? I think that&#x27;s the worst word I will see or hear this week.","2448895":"Worst auto correct ever, btw.  &quot;Franken&quot;","3072409":"Why is this on the frontpage of hacker news? This is just a terrible advertisement.","982477":"You have received terrible tax advice.  Self-employment income is sourced where you performed the work which earned it, not where the money changed hands.  Ask me if you want voluminous citations on this.","2924692":"What an evil sentiment.","245254":"Yes... because everyone uses the terrible piece of software that is iTunes.  Even me as an iPhone user, I won&#x27;t be switching anytime soon- Spotify has a sense of community and music discovery.","864380":"You don&#x27;t think calling PG sociopathic or downright evil is hyperbolic?","1925774":"A despicable and disgusting comment the likes of which I don&#x27;t think I&#x27;ve ever seem on HN.<p>PLEASE DELETE IT.","1880708":"You realize that Canada is part of the evil five eyes.","2895253":"I used Flash on Android for three years and Playbook OS for one. Apple blocks Flash but that won&#x27;t stop it being horrible on mobile devices.","281028":"And so what if an &#x27;Atheist&#x27; did receive a bunch of cards like that? Why does it matter? Is the &#x27;Atheist&#x27; supposed to be &#x27;offended&#x27;? That is pathetic.","2658343":"That won&#x27;t happen. Some evil geek would write the parser and sell it to all of them.","2753808":"I found the UX to be horrible for the 5 minutes I used it.","2225939":"As a Swede, you&#x27;re shockingly uninformed.<p><a href=\"https:\/\/www.google.com\/search?q=sweden+welfare+immigration&amp;oq=sweden+welfare+immigration&amp;aqs=chrome..69i57j0.7462j0j4&amp;sourceid=chrome&amp;espv=210&amp;es_sm=93&amp;ie=UTF-8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;search?q=sweden+welfare+immigration&amp;o...<\/a>","682410":"If that would be the case then we would have another term for the thing I just described, because that&#x27;s the worst case scenario.<p>Anyhow, the Wikipedia article disagrees with you, too. Got any sources for your definition?","1698378":"I hope you die in terrible pain. I hope it takes years.","2158540":"It&#x27;s insulting because it addresses its target audience as though they are children, as if they don&#x27;t know how money works.","1926104":"Yep, and they stopped it because the CEO they hired to replace Ben (or Jerry I forget)  was horrible and mismanaged the company","1501387":"I for one endorse the ban of that terrible form of &quot;meta syntax&quot;.","2809868":"Worst idea ever!  It&#x27;s like &quot;upgrading&quot; humans to walk on 4 legs.","69413":"I installed Ubuntu with xmonad on my work mac after one terrible month with OSX&#x27;s pathetic window manager&#x2F;amethyst&#x2F;hacks.","2683491":"Matlab (and Octave) has terrible performance in every benchmark comparison I&#x27;ve ever seen. For example see the Julia benchmarks: <a href=\"http:\/\/julialang.org\/benchmarks\/\" rel=\"nofollow\">http:&#x2F;&#x2F;julialang.org&#x2F;benchmarks&#x2F;<\/a>","2924491":"How do you guarantee the enforcement of the rules of enforcement? The fundamental problem is a vicious circle. The abstraction of law leaks.","3042921":"Correct.  The runtime uses a copy-on-write implementation when you pass an array by value.<p>Duplicating an array in memory every time it is passed to or from a function would be awful.","2448982":"Agreed. My agency just switched over, and it is 100% awful.","1296614":"This market is getting awful crowed:  AppleTv, Roku, ChromeCast, and not to mention offering from manufacturers that are built into the tv.","1201423":"I was <i>almost<\/i> going to bail on the site because I couldnt scroll through it, NOR use my arrow-keys, ugh, horrible UX.","2598672":"I&#x27;m waiting for the chorus of feminists to fight this evil of gender inequality.","214154":"Just to give OP a heads up: the article&#x27;s font is rendering terribly in Windows Chrome.","1229661":"That&#x27;s a bleak outlook. In the end all we get are the &quot;pretty flowers on the hillside&quot;. Look at the sadness and say &quot;nothing can make up for that&quot; and you&#x27;ve died already.<p>I say &quot;look at the flowers on the hillside, nothing can cancel that out&quot;","1276596":"No.<p>The desire to translate all nutritional research into diet advice is what leads to fad diets and horrific misunderstanding of what science knows and doesn&#x27;t know about nutrition and metabolic pathways.","2748143":"No, please no this is terrible.","1501390":"But this isn&#x27;t readable at all.<p>If you compare it JSON.parse(x) or fromJSON x it&#x27;s just awful.","575197":"Google has the worst customer support I have ever seen.<p>I once had to transfer a domain for a client that Google had registered with Godaddy. Google blamed Godaddy and Godaddy blamed Google. What a nightmare.","3043372":"That&#x27;s a horribly slippery slope to just blunder on to.","1121235":"These people have 0 perspective whatsoever. I would kill to have, say, encountering a chemistry website called &quot;cispages&quot; be the worst thing I have to deal with in life.","281338":"<p><pre><code>  What disgusting arrogance.\n<\/code><\/pre>\nCould we please try to improve the tone of discourse here?","2153144":"s&#x2F;semantic&#x2F;pedantic&#x2F;<p>I know, that&#x27;s like the worst correction ever. I couldn&#x27;t resist. b^)","133162":"Ugh, how horrible!  DDoS&#x27;ing github is like kicking a puppy in the face.","2116537":"Horrible analogy is horrible","2191347":"I block everything and I get 25 blocked when visiting The Atlantic.  Probably the worst site I&#x27;ve seen yet.","2092120":"How&#x27;s the quality of your provider? I&#x27;ve been using MegaVOIP (also fed up with Skype) and it&#x27;s getting terrible.","931103":"This.<p>I was going to install a torch app and it wanted access to my contacts and call history?!?!<p>Took a while but I found one that just needed camera access (to activate the LED). Not all apps are completely evil but the majority appear to be.","1565993":"Why evil yandex?","981279":"It&#x27;s not just resolution. The MBA also has a TN panel with relatively terrible viewing angles.","2373545":"So you think she shouldn&#x27;t feel resentful for people being nasty about her?","1802782":"Hotel regulations are awful!","2476546":"&#x27;don&#x27;t be evil to me, or else&#x27;","981207":"I think he means the tendencies which overtake us if we don&#x27;t think deliberately about them, like procrastination. Procrastination is my worst instinct, and at times the biggest obstacle between myself and my goals.","2041007":"BREAKING: Capitalism is worst system except for all the others.<p>News at 11.","955852":"If the sales rep was arguing for you not to use auto pay he is the worst sales rep of all time.","838302":"Piledriver, boring :&#x2F;","345206":"Holy crap, the background image for that presentation slides is 780KB and the background image for the page is 786KB<p><a href=\"http:\/\/www.joshmatthews.net\/fosdemservo\/themes\/mozilla\/images\/bg-darkgrey-2.png\" rel=\"nofollow\">http:&#x2F;&#x2F;www.joshmatthews.net&#x2F;fosdemservo&#x2F;themes&#x2F;mozilla&#x2F;image...<\/a><p><a href=\"http:\/\/www.joshmatthews.net\/fosdemservo\/themes\/mozilla\/images\/bg-sandstone-2.png\" rel=\"nofollow\">http:&#x2F;&#x2F;www.joshmatthews.net&#x2F;fosdemservo&#x2F;themes&#x2F;mozilla&#x2F;image...<\/a><p>Think of the mobile users!","2092328":"Know what else is offensive? The disgusting perversion of the justice system supported by people who don&#x27;t know the difference between bullies and victims. Feminism didn&#x27;t break the system.","292231":"And because tech workers see unions as evil....","2257897":"We offer an knowledge base widget that you can add to any page of your existing website and inherits your design and blends into. You can check it out at <a href=\"http:\/\/userdeck.com\/guides\" rel=\"nofollow\">http:&#x2F;&#x2F;userdeck.com&#x2F;guides<\/a> and if you have any questions or feedback, I&#x27;m all ears!","1396918":"Can you tell us what&#x27;s terrible? We are always eager to improve it.","103118":"I&#x27;ve not been to Lebanon, but what you&#x27;re describing sounds an awful lot like çiğ köfte: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Çiğ_köfte\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Çiğ_köfte<\/a> . You should give it a try if you can find it!","2317976":"I bet the person who maintained your code felt lost and stupid though! The benefit of libraries is that the reference exists at all.","2682529":"All those things are fanciful nonsense if users either avoid entering data, delay entering data or fudge data entry because the system is heroically terrible.","770586":"The pay is terrible though.","1651033":"I agree that it wasn&#x27;t written in a formal, etiquette-laden tone, but I didn&#x27;t find it to be malicious or insulting. I guess we&#x27;ll have to agree to disagree.","2600332":"Insane.","645898":"What horrible browser lets a website inspect the filesystem without permission?","1785101":"I wanted to stop reading immediately upon seeing the subtitle start with &quot;Technically incorrect.&quot;  Then I saw that&#x27;s the column name?  Terrible choice.","428364":"Jesus christ that looks terrible.","213417":"This is... this is awful. I had no idea this was a thing."}}